zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_lptim.h
/** @brief  Disable the specified DMA request.
  * @param  __HANDLE__ specifies the LPTIM Handle.
  * @param  __DMA__ specifies the LPTIM DMA request to disable.
  *          This parameter can be one of the following values:
  *            @arg LPTIM_DMA_UPDATE: Update DMA request
  *            @arg LPTIM_DMA_CC1:   Capture/Compare 1 DMA request
  *            @arg LPTIM_DMA_CC2:   Capture/Compare 2 DMA request
  * @retval None
  */
#define __HAL_LPTIM_DISABLE_DMA(__HANDLE__, __DMA__)        ((__HANDLE__)->Instance->DIER &= ~(__DMA__))

/**
  * @brief  Check whether the specified LPTIM interrupt source is enabled or not.
  * @param  __HANDLE__ LPTIM handle.
  * @param  __INTERRUPT__ LPTIM interrupt to check.
  *            This parameter can be a value of:
  *            @arg LPTIM_IT_REPOK   : Repetition register update OK Interrupt.
  *            @arg LPTIM_IT_UPDATE  : Update event register Interrupt.
  *            @arg LPTIM_IT_DOWN    : Counter direction change up Interrupt.
  *            @arg LPTIM_IT_UP      : Counter direction change down to up Interrupt.
  *            @arg LPTIM_IT_ARROK   : Autoreload register update OK Interrupt.
  *            @arg LPTIM_IT_CMP1OK  : Compare register 1 update OK Interrupt.
  *            @arg LPTIM_IT_CMP2OK  : Compare register 2 update OK Interrupt.
  *            @arg LPTIM_IT_EXTTRIG : External trigger edge event Interrupt.
  *            @arg LPTIM_IT_ARRM    : Autoreload match Interrupt.
  *            @arg LPTIM_IT_CC1     : Capture/Compare 1 interrupt Interrupt.
  *            @arg LPTIM_IT_CC2     : Capture/Compare 2 interrupt Interrupt.
  *            @arg LPTIM_IT_CC1O    : Capture/Compare 1 over-capture Interrupt.
  *            @arg LPTIM_IT_CC2O    : Capture/Compare 2 over-capture Interrupt.
  * @retval Interrupt status.
  */

#define __HAL_LPTIM_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->DIER\
                                                                & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

#if defined(CORE_CA35)
#define __HAL_LPTIM_LPTIM1_EXTI_ENABLE_IT()            (EXTI1->C1IMR2\
                                                        |= LPTIM_EXTI_LINE_LPTIM1)
#define __HAL_LPTIM_LPTIM1_EXTI_DISABLE_IT()           (EXTI1->C1IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM1))

#define __HAL_LPTIM_LPTIM2_EXTI_ENABLE_IT()            (EXTI1->C1IMR2\
                                                        |= LPTIM_EXTI_LINE_LPTIM2)
#define __HAL_LPTIM_LPTIM2_EXTI_DISABLE_IT()           (EXTI1->C1IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM2))

#define __HAL_LPTIM_LPTIM3_EXTI_ENABLE_IT()            (EXTI2->C1IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM3)
#define __HAL_LPTIM_LPTIM3_EXTI_DISABLE_IT()           (EXTI2->C1IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM3))

#define __HAL_LPTIM_LPTIM4_EXTI_ENABLE_IT()            (EXTI2->C1IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM4)
#define __HAL_LPTIM_LPTIM4_EXTI_DISABLE_IT()           (EXTI2->C1IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM4))

#define __HAL_LPTIM_LPTIM5_EXTI_ENABLE_IT()            (EXTI2->C1IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM5)
#define __HAL_LPTIM_LPTIM5_EXTI_DISABLE_IT()           (EXTI2->C1IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM5))
#elif defined(CORE_CM33)
#define __HAL_LPTIM_LPTIM1_EXTI_ENABLE_IT()            (EXTI1->C2IMR2\
                                                        |= LPTIM_EXTI_LINE_LPTIM1)
#define __HAL_LPTIM_LPTIM1_EXTI_DISABLE_IT()           (EXTI1->C2IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM1))

#define __HAL_LPTIM_LPTIM2_EXTI_ENABLE_IT()            (EXTI1->C2IMR2\
                                                        |= LPTIM_EXTI_LINE_LPTIM2)
#define __HAL_LPTIM_LPTIM2_EXTI_DISABLE_IT()           (EXTI1->C2IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM2))

#define __HAL_LPTIM_LPTIM3_EXTI_ENABLE_IT()            (EXTI2->C2IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM3)
#define __HAL_LPTIM_LPTIM3_EXTI_DISABLE_IT()           (EXTI2->C2IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM3))

#define __HAL_LPTIM_LPTIM4_EXTI_ENABLE_IT()            (EXTI2->C2IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM4)
#define __HAL_LPTIM_LPTIM4_EXTI_DISABLE_IT()           (EXTI2->C2IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM4))

#define __HAL_LPTIM_LPTIM5_EXTI_ENABLE_IT()            (EXTI2->C2IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM5)
#define __HAL_LPTIM_LPTIM5_EXTI_DISABLE_IT()           (EXTI2->C2IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM5))
#elif defined(CORE_CM0PLUS)

#define __HAL_LPTIM_LPTIM3_EXTI_ENABLE_IT()            (EXTI2->C3IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM3)
#define __HAL_LPTIM_LPTIM3_EXTI_DISABLE_IT()           (EXTI2->C3IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM3))

#define __HAL_LPTIM_LPTIM4_EXTI_ENABLE_IT()            (EXTI2->C3IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM4)
#define __HAL_LPTIM_LPTIM4_EXTI_DISABLE_IT()           (EXTI2->C3IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM4))

#define __HAL_LPTIM_LPTIM5_EXTI_ENABLE_IT()            (EXTI2->C3IMR1\
                                                        |= LPTIM_EXTI_LINE_LPTIM5)
#define __HAL_LPTIM_LPTIM5_EXTI_DISABLE_IT()           (EXTI2->C3IMR1\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM5))
#endif /* CORE */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup LPTIM_Exported_Functions LPTIM Exported Functions
  * @{
  */

