zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_lptim.h
#if defined(CORE_CM0PLUS)
#define IS_LPTIM_INPUT1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM3) || \
    ((__INSTANCE__) == LPTIM4) || \
    ((__INSTANCE__) == LPTIM5)) && \
   ((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO))
#else /* CORE_CM0PLUS */
#define IS_LPTIM_INPUT1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) || \
    ((__INSTANCE__) == LPTIM2) || \
    ((__INSTANCE__) == LPTIM3) || \
    ((__INSTANCE__) == LPTIM4) || \
    ((__INSTANCE__) == LPTIM5)) && \
   ((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO))
#endif /* else CORE_CM0PLUS */

#if defined(CORE_CM0PLUS)
#define IS_LPTIM_INPUT2_SOURCE(__INSTANCE__, __SOURCE__) \
  (0 == 1)
#else /* CORE_CM0PLUS */
#define IS_LPTIM_INPUT2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) || \
    ((__INSTANCE__) == LPTIM2)) && \
   (((__SOURCE__) == LPTIM_INPUT2SOURCE_GPIO)))
#endif /* else CORE_CM0PLUS */

#if defined(CORE_CM0PLUS)
#define IS_LPTIM_IC1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM3) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_MSI)))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO)||        \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSI) ||        \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSE))))

#define IS_LPTIM_IC2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM3) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO))          \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO)))
#else /* CORE_CM0PLUS */
#if defined(STM32MP25xxxx)
#define IS_LPTIM_IC1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) &&                   \
    ((__SOURCE__) == LPTIM_IC1SOURCE_GPIO))          \
   ||                                              \
   (((__INSTANCE__) == LPTIM2) &&                   \
    ((__SOURCE__) == LPTIM_IC1SOURCE_GPIO))          \
   ||                                              \
   (((__INSTANCE__) == LPTIM3) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_MSI)))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO)    ||    \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSI) ||        \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSE))))

#define IS_LPTIM_IC2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) &&                   \
    (((__SOURCE__) == LPTIM_IC2SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC2SOURCE_HSI_1024) ||   \
     ((__SOURCE__) == LPTIM_IC2SOURCE_MSI)))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM2) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO))          \
   ||                                              \
   (((__INSTANCE__) == LPTIM3) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO)))
#endif /* STM32MP25xxxx */

#if defined(STM32MP21xxxx)
#define IS_LPTIM_IC1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C1_IBIACK) || \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C2_IBIACK) || \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C3_IBIACK)))  \
   ||                                              \
   (((__INSTANCE__) == LPTIM2) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C1_IBIACK) || \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C2_IBIACK) || \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C3_IBIACK)))  \
   ||                                              \
   (((__INSTANCE__) == LPTIM3) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_MSI) ||        \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C2_IBIACK) || \
     ((__SOURCE__) == LPTIM_IC1SOURCE_I3C3_IBIACK)))  \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSI) ||        \
     ((__SOURCE__) == LPTIM_IC1SOURCE_LSE))))

#define IS_LPTIM_IC2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) &&                   \
    (((__SOURCE__) == LPTIM_IC2SOURCE_GPIO) ||       \
     ((__SOURCE__) == LPTIM_IC2SOURCE_HSI_1024) ||   \
     ((__SOURCE__) == LPTIM_IC2SOURCE_MSI)))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM2) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO))          \
   ||                                              \
   (((__INSTANCE__) == LPTIM3) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO))         \
   ||                                              \
   (((__INSTANCE__) == LPTIM4) &&                   \
    ((__SOURCE__) == LPTIM_IC2SOURCE_GPIO)))
#endif /* STM32MP21xxxx */
#endif /* else CORE_CM0PLUS */

#define LPTIM_CHANNEL_STATE_GET(__INSTANCE__, __CHANNEL__)\
  (((__CHANNEL__) == LPTIM_CHANNEL_1) ? (__INSTANCE__)->ChannelState[0] :\
   (__INSTANCE__)->ChannelState[1])

#define LPTIM_CHANNEL_STATE_SET(__INSTANCE__, __CHANNEL__, __CHANNEL_STATE__) \
  (((__CHANNEL__) == LPTIM_CHANNEL_1) ? ((__INSTANCE__)->ChannelState[0] = (__CHANNEL_STATE__)) :\
   ((__INSTANCE__)->ChannelState[1] = (__CHANNEL_STATE__)))

#define LPTIM_CHANNEL_STATE_SET_ALL(__INSTANCE__,  __CHANNEL_STATE__) do { \
                                                                           (__INSTANCE__)->ChannelState[0]  =\
                                                                                                (__CHANNEL_STATE__);  \
                                                                           (__INSTANCE__)->ChannelState[1]  =\
                                                                                                (__CHANNEL_STATE__);  \
                                                                         } while(0)

