zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_lptim.h
#if defined (CORE_CM33) && defined (CORTEX_IN_SECURE_STATE)
#define IS_LPTIM_CCX_INSTANCE(__INSTANCE__, __CHANNEL__) \
  (((((__INSTANCE__) == LPTIM1_NS)  || ((__INSTANCE__) == LPTIM1_S))  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   ((((__INSTANCE__) == LPTIM2_NS)  || ((__INSTANCE__) == LPTIM2_S))  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   ((((__INSTANCE__) == LPTIM3_NS)  || ((__INSTANCE__) == LPTIM3_S))  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   ((((__INSTANCE__) == LPTIM4_NS)  || ((__INSTANCE__) == LPTIM4_S))  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   ((((__INSTANCE__) == LPTIM5_NS)  || ((__INSTANCE__) == LPTIM5_S))  && \
    ((__CHANNEL__)  == LPTIM_CHANNEL_1)))
#elif (defined (CORE_CM33) && ! defined (CORTEX_IN_SECURE_STATE)) || defined (CORE_CA35)
#define IS_LPTIM_CCX_INSTANCE(__INSTANCE__, __CHANNEL__) \
  ((((__INSTANCE__)  == LPTIM1)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__)  == LPTIM2)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__)  == LPTIM3)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__)  == LPTIM4)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__)  == LPTIM5)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1))))
#elif defined (CORE_CM0PLUS)
#define IS_LPTIM_CCX_INSTANCE(__INSTANCE__, __CHANNEL__) \
  ((((__INSTANCE__)  == LPTIM3)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__) == LPTIM4)  && \
    (((__CHANNEL__) == LPTIM_CHANNEL_1) ||   \
     ((__CHANNEL__) == LPTIM_CHANNEL_2)))    \
   ||                                        \
   (((__INSTANCE__) == LPTIM5)  && \
    ((__CHANNEL__) == LPTIM_CHANNEL_1)))
#endif /* CORE_C... */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup LPTIM_Private_Functions LPTIM Private Functions
  * @{
  */
/**
  * @}
  */

/**
  * @}
  */

#endif /* LPTIM1 || LPTIM2 ||  LPTIM3 || LPTIM4 || LPTIM5 */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_LPTIM_H */
